<template>
  <div class="terms-of-service-page">
    <header class="page-header">
      <h1>Условия использования</h1>
    </header>

    <main class="page-content">
      <section>
        <h2>1. Общие положения</h2>
        <p>
          Настоящие Условия использования (далее — Условия) регулируют порядок использования веб-сайта <b>ИП Главацкий П.Е.</b> (далее — Сайт) и предоставляют пользователям (далее — Пользователь) доступ к информации и услугам.
        </p>
        <p>
          Используя Сайт, Пользователь соглашается с настоящими Условиями. Если вы не согласны с какими-либо из положений, пожалуйста, прекратите использование Сайта.
        </p>
      </section>

      <section>
        <h2>2. Предоставление услуг</h2>
        <p>
          2.1. ИП Главацкий П.Е. предоставляет услуги по ремонту и отделке помещений через Сайт.
        </p>
        <p>
          2.2. Все услуги предоставляются на условиях, указанных на Сайте, а также в договорах, заключенных между Компанией и Пользователем.
        </p>
        <p>
          2.3. Компания оставляет за собой право изменять условия предоставления услуг без предварительного уведомления.
        </p>
      </section>

      <section>
        <h2>3. Регистрация и учетные записи</h2>
        <p>
          3.1. Для использования некоторых функций Сайта может потребоваться регистрация. Пользователь обязуется предоставлять достоверную информацию при регистрации.
        </p>
        <p>
          3.2. Пользователь несет ответственность за сохранность своих учетных данных и их конфиденциальность.
        </p>
        <p>
          3.3. Компания имеет право заблокировать или удалить учетную запись Пользователя в случае нарушения настоящих Условий.
        </p>
      </section>

      <section>
        <h2>4. Права и обязанности сторон</h2>
        <p>
          4.1. <strong>Права Компании:</strong>
        </p>
          <ul>
            <li>Изменять содержание Сайта и его функционал;</li>
            <li>Ограничить доступ к Сайту в случае нарушения Пользователем Условий;</li>
            <li>Требовать выполнения обязательств со стороны Пользователя.</li>
          </ul>
        <p>
          4.2. <strong>Обязанности Компании:</strong>
        </p>
          <ul>
            <li>Обеспечивать работоспособность Сайта;</li>
            <li>Защищать персональные данные Пользователя в соответствии с Политикой конфиденциальности.</li>
          </ul>
        <p>
          4.3. <strong>Обязанности Пользователя:</strong>
        </p>
          <ul>
            <li>Не нарушать права других пользователей и третьих лиц;</li>
            <li>Не использовать Сайт для незаконных целей;</li>
            <li>Соблюдать настоящие Условия и требования законодательства РФ.</li>
          </ul>
      </section>

      <section>
        <h2>5. Ограничение ответственности</h2>
        <p>
          5.1. Компания не несет ответственности за любые убытки, возникшие в результате использования или невозможности использования Сайта.
        </p>
        <p>
          5.2. Компания не гарантирует бесперебойную работу Сайта и не несет ответственности за временные сбои или ошибки.
        </p>
        <p>
          5.3. Пользователь использует Сайт на свой страх и риск.
        </p>
      </section>

      <section>
        <h2>6. Использование цен и материалов Сайта</h2>
        <p>
          6.1. Цены на услуги, указанные в прайс-листе, являются ориентировочными и могут быть изменены Компанией без предварительного уведомления.
        </p>
        <p>
          6.2. Все материалы, включая цены, тексты, изображения и другие элементы, размещенные на Сайте, являются собственностью ИП Главацкий П.Е. или его партнеров.
        </p>
        <p>
          6.3. Запрещается использование цен и других материалов Сайта для коммерческих целей, включая:
        </p>
          <ul>
            <li>Копирование цен для использования на сторонних ресурсах;</li>
            <li>Распространение информации о ценах без письменного согласия Компании;</li>
            <li>Использование цен в рекламных материалах третьих лиц.</li>
          </ul>
        <p>
          6.4. Любое использование материалов Сайта допускается только с письменного разрешения ИП Главацкий П.Е..
        </p>
        <p>
          6.5. Нарушение данных правил может повлечь за собой юридическую ответственность в соответствии с действующим законодательством РФ.
        </p>
      </section>

      <section>
        <h2>7. Изменение условий</h2>
        <p>
          7.1. Компания оставляет за собой право вносить изменения в настоящие Условия. Все изменения вступают в силу с момента их публикации на Сайте.
        </p>
        <p>
          7.2. Продолжение использования Сайта после внесения изменений означает согласие Пользователя с новой версией Условий.
        </p>
      </section>

      <section>
        <h2>8. Контактная информация</h2>
        <p>
          По всем вопросам, связанным с настоящими Условиями, вы можете связаться с нами:
        </p>
          <ul>
            <li><strong>Электронная почта:</strong> info@glavprofi.ru</li>
            <li><strong>Телефон:</strong> +7 (910) 909-69-47</li>
            <li><strong>Юридический адрес:</strong> г. Рязань, ул. Право-Лыбедская ул., 40</li>
          </ul>
      </section>
    </main>
  </div>
</template>

<style lang="scss" scoped>
.terms-of-service-page {
  margin-top: 5em;
  padding: 40px 20px;
  font-family: Arial, sans-serif;
  line-height: 1.6;
  color: #333;

  @media (max-width: 768px) {
    margin-top: 2em;
  }

  .page-header {
    text-align: center;
    margin-bottom: 40px;

    h1 {
      font-size: 2rem;
      color: #18191b;
    }
  }

  .page-content {
    max-width: 1200px;
    margin: 0 auto;

    section {
      margin-bottom: 30px;

      h2 {
        font-size: 1.5rem;
        // color: #00c3f5;
        margin-bottom: 15px;
      }

      p {
        font-size: 1rem;
        // color: #555;
      }

      ul {
        margin-left: 20px;
        list-style-type: disc;

        li {
          margin-bottom: 5px;
        }
      }
    }
  }
}
</style>