<template>
  <PagesPublicPrivacyPolicy />
</template>

<script setup>
useHead({
  title: 'Политика конфиденциальности сайта компании ГлавПрофи',
  meta: [
    { name: 'description', content: 'Политика конфиденциальности ГлавПрофи. Как мы собираем, используем и защищаем ваши персональные данные при оказании услуг по ремонту коммерческих помещений' },
    { property: 'og:title', content: 'Политика конфиденциальности сайта компании ГлавПрофи' },
    { property: 'og:description', content: 'Политика конфиденциальности ГлавПрофи. Как мы собираем, используем и защищаем ваши персональные данные при оказании услуг по ремонту коммерческих помещений' },
  ]
})
</script>