<template>
  <PagesPublicTerms />
</template>

<script setup>
useHead({
  title: 'Условия использования сайта компании ГлавПрофи',
  meta: [
    { name: 'description', content: 'Условия использования услуг компании ГлавПрофи. Ознакомьтесь с правилами и соглашениями перед использованием наших услуг по ремонту коммерческих помещений' },
    { property: 'og:title', content: 'Условия использования сайта компании ГлавПрофи' },
    { property: 'og:description', content: 'Условия использования услуг компании ГлавПрофи. Ознакомьтесь с правилами и соглашениями перед использованием наших услуг по ремонту коммерческих помещений' },
  ]
})
</script>